rocksdb/experiments/M2/results/20260429-055153-budget-sensitivity/bmin_6_ptarget_0p5/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 06:02:08 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777442528560472 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.496 micros/op 117700 ops/sec 42.481 seconds 5000000 operations;  116.7 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       9.058 micros/op 110401 ops/sec 45.289 seconds 5000000 operations;  109.5 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      10.036 micros/op 99645 ops/sec 50.178 seconds 5000000 operations;   98.8 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      9/0   560.58 MB   2.2      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    455.6     32.81             23.59       240    0.137       0      0       0.0       0.0
  L1     22/1    1.35 GB   5.2     26.7    14.0     12.6      23.5     10.9       0.0   1.7    351.0    310.0     77.77             57.14        20    3.889     27M  3167K       0.0       0.0
  L2     90/4    4.51 GB   1.8     21.1     9.0     12.1      16.0      3.9       0.6   1.8    383.7    291.3     56.25             40.53       142    0.396     21M  5164K       0.0       0.0
 Sum    121/5    6.41 GB   0.0     47.7    23.1     24.7      54.1     29.5       0.6   3.7    293.0    332.3    166.82            121.26       402    0.415     48M  8332K       0.0       0.0
 Int      0/0    0.00 KB   0.0     47.5    22.8     24.7      53.5     28.8       0.6   3.8    294.2    331.2    165.32            120.10       394    0.420     48M  8328K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     47.7    23.1     24.7      39.5     14.9       0.0   0.0    364.7    302.1    134.02             97.67       162    0.827     48M  8332K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    455.6     32.81             23.59       240    0.137       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 138.0 total, 135.0 interval
Flush(GB): cumulative 14.597, interval 14.172
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 54.14 GB write, 401.86 MB/s write, 47.73 GB read, 354.30 MB/s read, 166.8 seconds
Interval compaction: 53.48 GB write, 405.78 MB/s write, 47.49 GB read, 360.35 MB/s read, 165.3 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 22, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 22, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 22, total-stops: 0
interval: 22 total count
Block cache LRUCache@0x564c29079df0#84684 capacity: 32.00 MB seed: 377881944 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.00018 secs_since: 137
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 138.0 total, 135.0 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 109.50 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 109.50 MB/s
Cumulative stall: 00:00:39.234 H:M:S, 28.4 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14649.74 MB, 108.56 MB/s
Interval WAL: 14M writes, 0 syncs, 14546745.00 writes per sync, written: 14.31 GB, 108.56 MB/s
Interval stall: 00:00:39.234 H:M:S, 29.1 percent
Write Stall (count): write-buffer-manager-limit-stops: 0